Revit 2027 API
ParameterTypeId.RailingPathCurvePropertiesHeightCorrectionOption Property
 "Rail Height Correction": Built-in param used for overriding railing curve height correction in a sketch via UI
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingPathCurvePropertiesHeightCorrectionOption { get; }
Public Shared ReadOnly Property RailingPathCurvePropertiesHeightCorrectionOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingPathCurvePropertiesHeightCorrectionOption {
	ForgeTypeId^ get ();
}
static member RailingPathCurvePropertiesHeightCorrectionOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace